000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СоответствиеДокументовNavision/СоответствиеДокументовNavision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеДокументовNavision</name>
  <resources>
    <name>РезультатСверки</name>
    <type>
      <types>EnumRef.РезультатСверкиNavision</types>
    </type>
  </resources>
  <resources>
    <name>IDN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СообщитьNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>String</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПересчетТоваровСамостоятельный</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.КассовыйДень</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Ресурс предназначен для фильтрации в правилах регистрации</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СоответствиеДокументовNavision/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте	//	LNK 06.05.2024 16:01:41
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Если РегистрацияВыполнена(Запись) Тогда

		ПоказатьОповещениеПользователя("Выполнено!"
			,
			, "Регистрация текущей записи для NAV выполнена!"
			, БиблиотекаКартинок.Информация32
		);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста	//	LNK 06.05.2024 16:03:50
Функция РегистрацияВыполнена(Знач ЭтаЗапись)

	НаборЗаписей = РегистрыСведений.СоответствиеДокументовNavision.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаЗапись.Объект);
	НаборЗаписей.Отбор.Магазин.Установить(ЭтаЗапись.Магазин);

	Если ПланыОбмена.ИзменениеЗарегистрировано(ВнешниеИсточникиПовтИсп.СписокУзловNavision()[0], НаборЗаписей) Тогда

			Возврат Истина;

	Иначе	Возврат Ложь;

	КонецЕсли;

	Возврат Истина;

КонецФункции
